courseworks/week3/yushengzhao/ans.org
#+TITLE: Assignment 1
#+AUTHOR: Yusheng Zhao
#+OPTIONS: toc:nil

* Problem 1
#+begin_src julia  :exports both :results output
begin
    type_arr = [ComplexF64;Complex{AbstractFloat};Complex{<:AbstractFloat};
                AbstractFloat;Union{Float64, ComplexF64};
                Int32;Matrix{Float32};Base.RefValue];

    for aType in type_arr
        print("|",aType)
        print("|",isconcretetype(aType))
        print("|",isprimitivetype(aType))
        print("|",isabstracttype(aType))
        print("|",isbitstype(aType))
        print("|",ismutable(aType))
        println("|")
    end
end
#+end_src

#+RESULTS:
: |ComplexF64|true|false|false|true|true|
: |Complex{AbstractFloat}|true|false|false|false|true|
: |Complex{<:AbstractFloat}|false|false|false|false|false|
: |AbstractFloat|false|false|true|false|true|
: |Union{Float64, ComplexF64}|false|false|false|false|false|
: |Int32|true|true|false|true|true|
: |Matrix{Float32}|true|false|false|false|true|
: |Base.RefValue|false|false|false|false|false|

    | Types                      | isconcrete | isprimitive | isabstract | isbitstype | ismutable |
    |----------------------------+------------+-------------+------------+------------+-----------|
    | ComplexF64                 | true       | false       | false      | true       | true      |
    | Complex{AbstractFloat}     | true       | false       | false      | false      | true      |
    | Complex{<:AbstractFloat}   | false      | false       | false      | false      | false     |
    | AbstractFloat              | false      | false       | true       | false      | true      |
    | Union{Float64, ComplexF64} | false      | false       | false      | false      | false     |
    | Int32                      | true       | true        | false      | true       | true      |
    | Matrix{Float32}            | true       | false       | false      | false      | true      |
    | Base.RefValue              | false      | false       | false      | false      | false     |

* Problem 2
** Part a
- I did it.

** Part b
- See ~brownian.jl~
